core/app/Models/Model_data.php

    public function tampilPengguna()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->select('*');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_user`

    public function cekUsername($username)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->where('username', $username);
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'tps34'

    public function tampilDataDPT()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->select('*');
        $builder->orderBy('idDPT', 'ASC');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_dpt`
ORDER BY `idDPT` ASC

    public function jumlahPemilih()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`

    public function jumlahPemilihDPT()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('status', "1");
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `status` = '1'

    public function jumlahPemilihDPTB()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('status', "2");
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `status` = '2'

    public function jumlahPemilihDPK()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('status', "3");
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `status` = '3'

    public function jumlahPemilihHadir()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('kehadiran', "1");
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `kehadiran` = '1'

    public function jumlahPemilihLaki()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('jenisKelamin', "L");
        $builder->select('*');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `jenisKelamin` = 'L'

    public function jumlahPemilihPerempuan()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('jenisKelamin', "P");
        $builder->select('*');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `jenisKelamin` = 'P'

    public function jumlahPemilihLakiHadir()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('jenisKelamin', "L");
        $builder->where('kehadiran', "1");
        $builder->select('*');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `jenisKelamin` = 'L'
AND `kehadiran` = '1'

    public function jumlahPemilihPerempuanHadir()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_dpt');
        $builder->where('jenisKelamin', "P");
        $builder->where('kehadiran', "1");
        $builder->select('*');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_dpt`
WHERE `jenisKelamin` = 'P'
AND `kehadiran` = '1'