core/app/Controllers/Pemilih.php

    public function tambahPemilih()
    {
        $session        = session();
        $modelDPT       = new Model_dpt;
        $nama           = $this->request->getPost('nama');
        $alamat         = $this->request->getPost('alamat');
        $jenisKelamin   = $this->request->getPost('jenisKelamin');
        $status         = $this->request->getPost('status');
        $data = [
            'namaPemilih' => $nama,
            'alamat' => $alamat,
            'jenisKelamin' => $jenisKelamin,
            'status' => $status,
            'kehadiran' => 1
        ];
        $modelDPT->insert($data);
---
INSERT INTO `tbl_dpt` (`namaPemilih`, `alamat`, `jenisKelamin`, `status`, `kehadiran`) VALUES ('asdasd', 'asdasd', 'L', '2', 1)